In [2]:
import pandas as pd

serie1 = pd.Series([3,5,7])
serie1

0    3
1    5
2    7
dtype: int64

In [4]:
# crear indices

asignaturas = ["mat", "lit", "fisica", "hist"]
notas = [8,6,9,1]
serie_notas_alumno1 = pd.Series(notas, index=asignaturas)
serie_notas_alumno1

mat       8
lit       6
fisica    9
hist      1
dtype: int64

In [5]:
serie_notas_alumno1["lit"]

6

In [7]:
serie_notas_alumno1[serie_notas_alumno1 >= 8]

mat       8
fisica    9
dtype: int64

In [8]:
serie_notas_alumno1.name = "Notas de Daniel"
serie_notas_alumno1

mat       8
lit       6
fisica    9
hist      1
Name: Notas de Daniel, dtype: int64

In [9]:
serie_notas_alumno1.index.name = "asignaturas de daniel"
serie_notas_alumno1

asignaturas de daniel
mat       8
lit       6
fisica    9
hist      1
Name: Notas de Daniel, dtype: int64

In [10]:
diccionario = serie_notas_alumno1.to_dict() # convierte a diccionario
diccionario

{'mat': 8, 'lit': 6, 'fisica': 9, 'hist': 1}

In [11]:
serie = pd.Series(diccionario)

In [12]:
serie

mat       8
lit       6
fisica    9
hist      1
dtype: int64

In [13]:
notas_alumno2 = [10,10,10,9]
serie_notas_alumno2 = pd.Series(notas_alumno2, index=asignaturas)
serie_notas_alumno2

mat       10
lit       10
fisica    10
hist       9
dtype: int64

In [14]:
serie_notas_clase = (serie_notas_alumno1 + serie_notas_alumno2 ) / 2

In [15]:
serie_notas_clase

asignaturas de daniel
mat       9.0
lit       8.0
fisica    9.5
hist      5.0
dtype: float64

In [29]:
# dataframes

import webbrowser

website = 'https://es.wikipedia.org/wiki/Anexo:Campeones_de_la_NBA'
webbrowser.open(website)

True

In [28]:
dataframe_nba = pd.read_clipboard()

In [19]:
dataframe_nba.columns

Index(['1950', 'Minneapolis Lakersn. 2​', '4–2', 'Syracuse Nationals†',
       '19​18​'],
      dtype='object')

In [30]:
dataframe_nba.head(6) # los primeros seis

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
0,1950,Minneapolis,Lakersn.,2​,4–2,Syracuse,Nationals†,19​18​,NaN
1,1951,Rochester,Royals,4–3,New,York,Knicks,20​,NaN
2,1952,Minneapolis,Lakers,4–3,New,York,Knicks,21​,NaN
3,1953,Minneapolis,Lakers†,4–1,New,York,Knicks,22​,NaN
4,1954,Minneapolis,Lakers†,4–3,Syracuse,Nationals,23​,None,NaN
5,1955,Ft.,Wayne,Pistons,3–4,Syracuse,Nationals†,24​,NaN

In [32]:
dataframe_nba.tail()  # cinco ultimos

,Año,Campeón,del,Oeste,Resultado,Campeón.1,del.1,Este,Ref.
9,1959,Minneapolis,Lakers,0–4,Boston,Celtics†,28​,None,NaN
10,1960,St.,Louis,Hawks,3–4,Boston,Celtics†,29​,NaN
11,1961,St.,Louis,Hawks,1–4,Boston,Celtics†,30​,NaN
12,1962,Los,Angeles,Lakers,3–4,Boston,Celtics†,31​,NaN
13,1963,Los,Angeles,Lakers,2–4,Boston,Celtics†,32​,NaN

In [36]:
dataframe_nba.loc[5] # resultados en indice 5, fila 5

Año                1955
Campeón             Ft.
del               Wayne
Oeste           Pistons
Resultado           3–4
Campeón.1      Syracuse
del.1        Nationals†
Este                24​
Ref.                NaN
Name: 5, dtype: object

In [37]:
dataframe_nba.tail(2)

     Año Campeón      del   Oeste Resultado Campeón.1     del.1 Este  Ref.
12  1962     Los  Angeles  Lakers       3–4    Boston  Celtics†  31​   NaN
13  1963     Los  Angeles  Lakers       2–4    Boston  Celtics†  32​   NaN

In [44]:
lista_asignaturas = ["mat", "hist", "fisi", "lit"]
lista_notas = [1,3,4,5]
diccionario = {'Asignaturas':lista_asignaturas, "Notas":lista_notas}
diccionario
dataframe_notas = pd.DataFrame(diccionario)
dataframe_notas

  Asignaturas  Notas
0         mat      1
1        hist      3
2        fisi      4
3         lit      5

In [45]:
# indices

lista_valores = [1,2,3]
lista_indices = ['a','b','c']
serie = pd.Series(lista_valores,lista_indices)
serie

a    1
b    2
c    3
dtype: int64

In [46]:
serie.index[0]

'a'

In [48]:
lista_valores = [[1,2,3], [9,8,3], [6,8,2]]
lista_indices =["mat", "hist", "lengua"]
lista_nombre = ["ana", "pedro", "marco"]
dataframe = pd.DataFrame(lista_valores, index=lista_indices, columns = lista_nombre)
dataframe

        ana  pedro  marco
mat       1      2      3
hist      9      8      3
lengua    6      8      2

In [49]:
# eliminar eelemntos en series

import numpy as np

In [50]:
np.arange(4)

array([0, 1, 2, 3])

In [51]:
serie = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [52]:
serie

a    0
b    1
c    2
d    3
dtype: int32

In [53]:
serie.drop('c')

a    0
b    1
d    3
dtype: int32

In [59]:
lista_valores = np.arange(9).reshape(3,3)
lista_indices = ['a', 'b', 'c']
lista_columnas = ['c1', 'c2', 'c3']
dataframe = pd.DataFrame(lista_valores, index=lista_indices, columns = lista_columnas)
dataframe.drop('b')
dataframe.drop('c2', axis=1)

   c1  c3
a   0   2
b   3   5
c   6   8

In [78]:
# seleccionar datos en las series

lista_valores = np.arange(3)
lista_indices = ['a', 'b', 'c']
serie = pd.Series(lista_valores, index=lista_indices)
serie = serie * 2
serie[2]
serie[0:2]
serie[0:3]
serie['a':'c']
serie[serie > 3] = 6
serie

a    0
b    2
c    6
dtype: int32

In [95]:
# seleccionando entradas para el dataframe

lista_valores = np.arange(25).reshape(5,5)
lista_indices = ['a', 'b', 'c', 'd', 'e']
lista_columnas = ['a', 'b', 'c', 'd', 'e']
dataframe = pd.DataFrame(lista_valores, lista_indices, lista_columnas)
dataframe['c']['d']
dataframe[['c','d']] # columnas c y d
dataframe > 20
dataframe
dataframe.loc['a']['b'] # fila y columna

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [104]:
# ordenaciion y clasificacion

lista = range(4)
indices = list('CABD')
serie  = pd.Series(lista, index=indices)
serie.sort_index()
serie.sort_values()
serie.rank()

serie2 = pd.Series(np.random.randn(10))
serie2

0    0.188266
1    0.166703
2    0.096714
3   -1.097143
4    0.372998
5    0.596266
6    0.595025
7   -0.130800
8    0.415240
9   -0.363384
dtype: float64

In [105]:
serie2.rank()

0     6.0
1     5.0
2     4.0
3     1.0
4     7.0
5    10.0
6     9.0
7     3.0
8     8.0
9     2.0
dtype: float64